Инструкция по применению:
<ul>
	<li>Соберите схему из нужных вам элементов. (правое меню)</li>
	<li>Чтобы схема корректно отображалась, необходимо, чтобы она была симметрична. (на её работоспособность это не влияет)</li>
	<li>Внимание! Цепь уже подключена к источнику питания. (так задуманно)</li>
	<li>Желательно работать в Google Chrome.</li>
	<li>Цепь не будет работать только в том случае, если электрон (вышедший слева) не придет в правую часть цепи. (в нашем случае это возможно, если поставить препятствие в виде ключа)</li>
</ul>
</td>
<hr>
Советы:
<ul>
	<li>Если нужна батарея элементов, то можете её создать либо вручную, либо поставив одну батарею, имитируя, что она - батарея элементов.</li>
</ul>
<hr>
Новости (update = 24.05.2015):
<ul>
	<li>Создан алгоритм "Проверка работоспособности цепи". (отображается вверху-слева.)</li>
	<li>Исправленны все баги и глюки. (если нашли баг, то писать на e-mail: tokiseven@mail.ru)</li>
</ul>
<hr>
План:
<ul>
	<li>Сделать отчет.</li>
</ul>